#### Pandas-DataFrame And Series
Pandas is a powerful data manipulation library in Python, widely used for data analysis and data cleaning. It provides two primary data structures: Series and DataFrame. A Series is a one-dimensional array-like object, while a DataFrame is a two-dimensional, size-mutable, and potentially heterogeneous tabular data structure with labeled axes (rows and columns).

In [1]:
import pandas as pd

In [2]:
## Series
##A Pandas Series is a one-dimensional array-like object that can hold any data type. It is similar to a column in a table.

import pandas as pd
data=[1,2,3,4,5]
series=pd.Series(data)
print("Series \n",series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.Series'>

In [4]:
## Create a Series from dictionary
data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [5]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [9]:
## Dataframe
## create a Dataframe from a dictionary oof list

data={
    'Name':['Krish','John','Jack'],
    'Age':[25,30,45],
    'City':['Bangalore','New York','Florida']
}
df=pd.DataFrame(data)
print(df,type(df),sep="\n")

    Name  Age       City
0  Krish   25  Bangalore
1   John   30   New York
2   Jack   45    Florida
<class 'pandas.DataFrame'>

In [35]:
## Create a Data frame From a List of Dictionaries

data=[
    {'Name':'Krish','Age':32,'City':'Bangalore'},
    {'Name':'John','Age':34,'City':'Bangalore'},
    {'Name':'Bappy','Age':32,'City':'Bangalore'},
    {'Name':'JAck','Age':32,'City':'Bangalore'}
    
]
df=pd.DataFrame(data,index=['krish','john',' Bappy','Jack'])
print(df)
print(type(df))

         Name  Age       City
krish   Krish   32  Bangalore
john     John   34  Bangalore
 Bappy  Bappy   32  Bangalore
Jack     JAck   32  Bangalore
<class 'pandas.DataFrame'>

In [31]:
rd = pd.read_csv('data.csv')
print(rd.head(6))
rd.head(6)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North
5  2023-01-06        B   54.0  Product3  192.0   West

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North
5  2023-01-06        B   54.0  Product3  192.0   West

In [24]:
rd.tail(6)

          Date Category  Value   Product  Sales Region
44  2023-02-14        A   96.0  Product3  830.0   East
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [32]:
### Accessing Data From Dataframe
df

    Name  Age       City
0  Krish   32  Bangalore
1   John   34  Bangalore
2  Bappy   32  Bangalore
3   JAck   32  Bangalore

In [36]:
df['Name']

krish     Krish
john       John
 Bappy    Bappy
Jack       JAck
Name: Name, dtype: str

In [43]:
df.loc[' Bappy']

Name        Bappy
Age            32
City    Bangalore
Name:  Bappy, dtype: object

In [39]:
df.iloc[2]

Name        Bappy
Age            32
City    Bangalore
Name:  Bappy, dtype: object

In [44]:
df

         Name  Age       City
krish   Krish   32  Bangalore
john     John   34  Bangalore
 Bappy  Bappy   32  Bangalore
Jack     JAck   32  Bangalore

In [51]:
## Accessing a specified element
df.at['john','Age']

np.int64(34)

In [48]:
df.at['Jack','Name']

'JAck'

In [52]:
## Accessing a specified element using iat
df.iat[2,2]

'Bangalore'

In [55]:
df['Salary'] = [10000,20000,50000,60000]

In [56]:
### Data MAnipulation with Dataframe
df

         Name  Age       City  Salary
krish   Krish   32  Bangalore   10000
john     John   34  Bangalore   20000
 Bappy  Bappy   32  Bangalore   50000
Jack     JAck   32  Bangalore   60000

In [58]:
## Adding a column
df['Salary']=[50000,60000,70000,10000]
df

         Name  Age       City  Salary
krish   Krish   32  Bangalore   50000
john     John   34  Bangalore   60000
 Bappy  Bappy   32  Bangalore   70000
Jack     JAck   32  Bangalore   10000

In [59]:
## Remove a column
df.drop('Salary',axis=1,inplace=True)

In [67]:
df

         Name  Age       City
john     John   36  Bangalore
 Bappy  Bappy   34  Bangalore
Jack     JAck   34  Bangalore

In [65]:
## Add age to the column
df['Age']=df['Age']+1
df

         Name  Age       City
john     John   36  Bangalore
 Bappy  Bappy   34  Bangalore
Jack     JAck   34  Bangalore

In [66]:
df.drop('krish',inplace=True)

KeyError: "['krish'] not found in axis"

In [64]:
df

         Name  Age       City
john     John   35  Bangalore
 Bappy  Bappy   33  Bangalore
Jack     JAck   33  Bangalore

In [68]:
df=pd.read_csv('data.csv')
df.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [69]:
# Display the data types of each column
print("Data types:\n", df.dtypes)

# Describe the DataFrame
print("Statistical summary:\n", df.describe())

Data types:
 Date            str
Category        str
Value       float64
Product         str
Sales       float64
Region          str
dtype: object
Statistical summary:
            Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000

In [70]:
df.describe()

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000